# DataFrames

In [2]:
import numpy as np
import pandas as pd

In [3]:
# Create random number

from numpy.random import randn
np.random.seed(101)

rand_mat=randn(5,4)

In [4]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

## Building up a DataFrame.

In [5]:
df= pd.DataFrame(data=rand_mat)

In [6]:
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

### Named Index and named Columns

In [7]:
df= pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns=['USA','GERMANY','INDIA','FRANCE'])

In [9]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [8]:
df

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Grabbing Data from a DataFrame.

#### Selecting a column

In [11]:
df['USA']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: USA, dtype: float64

In [12]:
df['FRANCE']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: FRANCE, dtype: float64

In [16]:
mylist= ['USA','GERMANY']
df[mylist]

        USA   GERMANY
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [20]:
df[['USA','GERMANY']]

        USA   GERMANY
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [22]:
# Creating a new Coumn

df['New']= df['USA']+df['GERMANY']

In [23]:
df

        USA   GERMANY     INDIA    FRANCE       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [26]:
# Removing a Coumn
df.drop('New',axis=1)

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df

        USA   GERMANY     INDIA    FRANCE       New
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [28]:
df.drop('New',axis=1,inplace=True)

In [29]:
df

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Selecting a ROW

In [30]:
df.drop('A')

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.drop('A',inplace=True)

In [33]:
df

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.loc['B']

USA        0.651118
GERMANY   -0.319318
INDIA     -0.848077
FRANCE     0.605965
Name: B, dtype: float64

In [36]:
df.iloc[1]

USA       -2.018168
GERMANY    0.740122
INDIA      0.528813
FRANCE    -0.589001
Name: C, dtype: float64

In [38]:
df.loc[['B','E']]

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.loc[['B','C']]

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [43]:
df.loc[['B','C']][['USA','FRANCE']]

        USA    FRANCE
B  0.651118  0.605965
C -2.018168 -0.589001

In [44]:
df >0

     USA  GERMANY  INDIA  FRANCE
B   True    False  False    True
C  False     True   True   False
D   True    False  False    True
E   True     True   True    True

In [45]:
df_bool = df>0

In [46]:
df_bool

     USA  GERMANY  INDIA  FRANCE
B   True    False  False    True
C  False     True   True   False
D   True    False  False    True
E   True     True   True    True

In [47]:
df[df_bool]

        USA   GERMANY     INDIA    FRANCE
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df['USA']>0

B     True
C    False
D     True
E     True
Name: USA, dtype: bool

In [50]:
df[df['USA']>0]

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df['USA']>0]['FRANCE'].loc['E']

0.6835088855389145

In [53]:
cond1= df['USA']>0
cond2 =  df['FRANCE'] >1

In [54]:
df[cond1 and cond2]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [55]:
df[(cond1) & (cond2)]

Empty DataFrame
Columns: [USA, GERMANY, INDIA, FRANCE]
Index: []

In [56]:
df[(cond1) | (cond2)]

        USA   GERMANY     INDIA    FRANCE
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df= pd.DataFrame(data=rand_mat)

In [59]:
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [60]:
df= pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns=['USA','GERMANY','INDIA','FRANCE'])

In [61]:
df

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df.reset_index()

  index       USA   GERMANY     INDIA    FRANCE
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [64]:
df

        USA   GERMANY     INDIA    FRANCE
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
new_ind = 'CA NY WY OR CO'.split()

In [66]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['States']=new_ind

In [68]:
df

        USA   GERMANY     INDIA    FRANCE States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [69]:
# Making Satets column as Index

df.set_index('States')

             USA   GERMANY     INDIA    FRANCE
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [70]:
df

        USA   GERMANY     INDIA    FRANCE States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [71]:
df.set_index('States',inplace=True)

In [72]:
df

             USA   GERMANY     INDIA    FRANCE
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   USA      5 non-null      float64
 1   GERMANY  5 non-null      float64
 2   INDIA    5 non-null      float64
 3   FRANCE   5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [75]:
df.dtypes

USA        float64
GERMANY    float64
INDIA      float64
FRANCE     float64
dtype: object

In [76]:
df.describe()

            USA   GERMANY     INDIA    FRANCE
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [77]:
df['USA']>0

States
CA     True
NY     True
WY    False
OR     True
CO     True
Name: USA, dtype: bool

In [78]:
ser_USA= df['USA']>0

In [79]:
ser_USA.value_counts()

True     4
False    1
Name: USA, dtype: int64

In [80]:
sum(ser_USA)

4

In [82]:
len(ser_USA)

5